RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usb.c
/**
 *******************************************************************************
 * @file  hc32_ll_usb.c
 * @brief USB core driver
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_usb.h"
#include "usb_bsp.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_USB USB
 * @brief USB Driver Library
 * @{
 */

#if (LL_USB_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
void usb_hoststop(LL_USB_TypeDef *USBx, uint8_t u8ChNum);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup USB_Global_Functions USB Global Functions
 * @{
 */

/**
 * @brief  core software reset
 * @param  [in] USBx        usb instance
 * @retval None
 */
void usb_coresoftrst(LL_USB_TypeDef *USBx)
{
    __IO uint8_t u8Status = USB_OK;;
    __IO uint32_t u32grstctl = 0UL;
    __IO uint32_t u32Count = 0UL;

    /* Wait for AHB master to be idle. */
    do {
        usb_udelay(1UL);
        u32grstctl = READ_REG32(USBx->GREGS->GRSTCTL);
        if (++u32Count > 100000UL) {
            u8Status = USB_ERROR;
        }
    } while (0UL == (u32grstctl & USBFS_GRSTCTL_AHBIDL));

    if (USB_OK == u8Status) {
        /* Write the Core Soft Reset bit to reset the USB core */
        u32Count = 0UL;
        u32grstctl |= USBFS_GRSTCTL_CSRST;
        WRITE_REG32(USBx->GREGS->GRSTCTL, u32grstctl);

        /* Wait for the reset finishing */
        do {
            u32grstctl = READ_REG32(USBx->GREGS->GRSTCTL);
            if (u32Count > 100000UL) {
                break;
            }
            u32Count++;
            usb_udelay(1UL);
        } while (0UL != (u32grstctl & USBFS_GRSTCTL_CSRST));
        /* Wait for at least 3 PHY clocks after the core resets */
        usb_udelay(3UL);
    }
}

/**
 * @brief  Writes a packet whose byte number is len into the Tx FIFO associated
 *         with the EP
 * @param  [in] USBx        usb instance
 * @param  [in] src         source pointer used to hold the transmited data
 * @param  [in] ch_ep_num   end point index
 * @param  [in] len         length in bytes
 * @param  [in] u8DmaEn     USB DMA status
 * @retval None
 */
void usb_wrpkt(LL_USB_TypeDef *USBx, uint8_t *src, uint8_t ch_ep_num, uint16_t len, uint8_t u8DmaEn)
{
    __IO uint32_t u32pAddr;
    __IO uint32_t *fifo;
    uint32_t u32Count32b;
    uint32_t u32Tmp;
    if (u8DmaEn == 0U) {
        u32Count32b = (len + 3UL);
        u32Count32b = u32Count32b >> 2U;
        fifo = USBx->DFIFO[ch_ep_num];
        u32Tmp = 0UL;
        while (u32Tmp < u32Count32b) {
            WRITE_REG32(*fifo, *((uint32_t *)src));
            u32pAddr = (uint32_t)src;
            src = (uint8_t *)(u32pAddr + 4U);
            u32Tmp++;
        }
    }
}

/**
 * @brief  Reads a packet whose byte number is len from the Rx FIFO
 * @param  [in] USBx        usb instance
 * @param  [in] dest        destination pointer that point to the received data
 * @param  [in] len         number of bytes
 * @retval None
 */
void usb_rdpkt(LL_USB_TypeDef *USBx, uint8_t *dest, uint16_t len)
{
    uint32_t u32Tmp;
    __IO uint32_t u32Count32b;
    __IO uint32_t u32pAddr;

    __IO uint32_t *fifo = USBx->DFIFO[0];
    u32Count32b = (len + 3UL);
    u32Count32b = u32Count32b >> 2U;
    u32pAddr = 0UL;
    u32Tmp = 0UL;
    while (u32Tmp < u32Count32b) {
        *(uint32_t *)dest = READ_REG32(*fifo);
        u32pAddr = (uint32_t)dest;
        dest = (uint8_t *)(u32pAddr + 4U);
        u32Tmp++;
    }
}

/**
 * @brief  Initialize the addresses of the core registers.
 * @param  [in] USBx        usb instance
 * @param  [in] basic_cfgs  usb core basic cfgs
 * @retval None
 */
void usb_setregaddr(LL_USB_TypeDef *USBx, USB_CORE_BASIC_CFGS *basic_cfgs)
{
    uint32_t u32Tmp = 0UL;
    uint32_t u32baseAddr;

    basic_cfgs->dmaen = 0U;
    /* initialize device cfg following its address */
    basic_cfgs->host_chnum = USB_MAX_CH_NUM;
    basic_cfgs->dev_epnum = USB_MAX_EP_NUM;
    basic_cfgs->core_type = 0U;   /* FS */
    basic_cfgs->phy_type = 0U;
#ifdef USB_FS_MODE
    u32baseAddr = CM_USBFS_BASE;
    basic_cfgs->core_type = 0U;   /* FS */
#endif /* USB_FS_MODE */

