RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usb.c
#ifdef USB_HS_MODE
    u32baseAddr = CM_USBHS_BASE;
    basic_cfgs->core_type = 1U;   /* HS */
#ifdef USB_HS_EXTERNAL_PHY
    basic_cfgs->phy_type = 1U;
#endif
#endif  /* USB_HS_MODE */

    USBx->GREGS = (USB_CORE_GREGS *)(u32baseAddr + 0UL);
    USBx->DREGS = (USB_CORE_DREGS *)(u32baseAddr + 0x800UL);

    while (u32Tmp < basic_cfgs->dev_epnum) {
        USBx->INEP_REGS[u32Tmp]  = (USB_CORE_INEPREGS *)(u32baseAddr + 0x900UL + (u32Tmp * 0x20UL));
        USBx->OUTEP_REGS[u32Tmp] = (USB_CORE_OUTEPREGS *)(u32baseAddr + 0xb00UL + (u32Tmp * 0x20UL));
        u32Tmp++;
    }
    u32Tmp = 0UL;
    while (u32Tmp < basic_cfgs->dev_epnum) {
        USBx->DFIFO[u32Tmp] = (uint32_t *)(u32baseAddr + 0x1000UL + (u32Tmp * 0x1000UL));
        u32Tmp++;
    }
    USBx->GCCTL = (uint32_t *)(u32baseAddr + 0xe00UL);
#ifdef USE_HOST_MODE     /* if the application mode is host */
    USBx->HREGS = (USB_CORE_HREGS *)(u32baseAddr + 0x400UL);
    USBx->HPRT = (uint32_t *)(u32baseAddr + 0x440UL);
    u32Tmp = 0UL;
    while (u32Tmp < basic_cfgs->host_chnum) {
        USBx->HC_REGS[u32Tmp] = (USB_CORE_HC_REGS *)(u32baseAddr + 0x500UL + (u32Tmp * 0x20UL));
        u32Tmp++;
    }
#endif  /* USE_HOST_MODE */
}

/**
 * @brief  Initializes the USB controller registers and prepares the core
 *         device mode or host mode operation.
 * @param  [in] USBx        usb instance
 * @param  [in] basic_cfgs  usb core basic cfgs
 * @retval None
 */
void usb_initusbcore(LL_USB_TypeDef *USBx, USB_CORE_BASIC_CFGS *basic_cfgs)
{
    /* reset the core through core soft reset */
    usb_coresoftrst(USBx);

    /* Select PHY for USB core*/
    usb_PhySelect(USBx, basic_cfgs->phy_type);
    /* reset the core through core soft reset */
    usb_coresoftrst(USBx);
    usb_mdelay(20UL);
    if (basic_cfgs->dmaen == 1U) {
        /* burst length/type(HBstLen) 64-words x32-bit,  core operates in a DMA mode*/
        usb_BurstLenConfig(USBx, 5U);
        usb_DmaCmd(USBx, 1U);
    }
}

/**
 * @brief  Flush a Tx FIFO whose index is num
 * @param  [in] USBx        usb instance
 * @param  [in] num         txFIFO index
 * @retval None
 */
void usb_txfifoflush(LL_USB_TypeDef *USBx, uint32_t num)
{
    __IO uint32_t u32grstctl;
    __IO uint32_t u32Tmp = 0UL;

    u32grstctl = USBFS_GRSTCTL_TXFFLSH | ((num & 0x1FUL) << USBFS_GRSTCTL_TXFNUM_POS);
    /* set the TxFIFO Flush bit, set TxFIFO Number */
    WRITE_REG32(USBx->GREGS->GRSTCTL, u32grstctl);

    /* wait for the finishing of txFIFO flushing */
    do {
        u32grstctl = READ_REG32(USBx->GREGS->GRSTCTL);
        if (u32Tmp <= 200000UL) {
            u32Tmp++;
        } else {
            break;
        }
        usb_udelay(1UL);
    } while (0UL != (u32grstctl & USBFS_GRSTCTL_TXFFLSH));
    /* Wait for at least 3 PHY clocks after the txfifo has been flushed */
    usb_udelay(3UL);
}

/**
 * @brief  Flush the whole rxFIFO
 * @param  [in] USBx        usb instance
 * @retval None
 */
void usb_rxfifoflush(LL_USB_TypeDef *USBx)
{
    __IO uint32_t u32grstctl;
    __IO uint32_t u32Tmp = 0UL;

    u32grstctl = USBFS_GRSTCTL_RXFFLSH;    /* set the RxFIFO Flush bit */
    WRITE_REG32(USBx->GREGS->GRSTCTL, u32grstctl);
    /* wait for the finishing of rxFIFO flushing */
    do {
        u32grstctl = READ_REG32(USBx->GREGS->GRSTCTL);
        if (u32Tmp <= 200000UL) {
            u32Tmp++;
        } else {
            break;
        }
        usb_udelay(1UL);
    } while (0UL != (u32grstctl & USBFS_GRSTCTL_RXFFLSH));
    /* Wait for at least 3 PHY clocks after the rxfifo has been flushed */
    usb_udelay(3UL);
}

/**
 * @brief  set the core to be host mode or device mode through the second
 *         input parameter.
 * @param  [in] USBx        usb instance
 * @param  [in] mode        mode of HOST_MODE or DEVICE_MODE that the core would be
 * @retval None
 */
void usb_modeset(LL_USB_TypeDef *USBx, uint8_t mode)
{
    if (mode == HOST_MODE) {
        MODIFY_REG32(USBx->GREGS->GUSBCFG, USBFS_GUSBCFG_FHMOD | USBFS_GUSBCFG_FDMOD, USBFS_GUSBCFG_FHMOD);
    } else {
        MODIFY_REG32(USBx->GREGS->GUSBCFG, USBFS_GUSBCFG_FHMOD | USBFS_GUSBCFG_FDMOD, USBFS_GUSBCFG_FDMOD);
    }
    /* wate for the change to take effect */
    usb_mdelay(50UL);
}

#ifdef USE_DEVICE_MODE

/**
 * @brief  initializes the initial status of all endpoints of the device to be
 *         disable.
 * @param  [in] USBx        usb instance
 * @param  [in] u8EpNum     EP number
 * @retval None
 */
void usb_devepdis(LL_USB_TypeDef *USBx, uint8_t u8EpNum)
{
    uint8_t u8Tmp = 0U;

    while (u8Tmp < u8EpNum) {
        if (0UL != READ_REG32_BIT(USBx->INEP_REGS[u8Tmp]->DIEPCTL, USBFS_DIEPCTL_EPENA)) {
            WRITE_REG32(USBx->INEP_REGS[u8Tmp]->DIEPCTL, USBFS_DIEPCTL_EPDIS | USBFS_DIEPCTL_SNAK);
        } else {
            WRITE_REG32(USBx->INEP_REGS[u8Tmp]->DIEPCTL, 0UL);
        }
        WRITE_REG32(USBx->INEP_REGS[u8Tmp]->DIEPTSIZ, 0UL);
        WRITE_REG32(USBx->INEP_REGS[u8Tmp]->DIEPINT, 0xFFUL);
        u8Tmp++;
    }

    u8Tmp = 0U;
    while (u8Tmp < u8EpNum) {
        if (0UL != READ_REG32_BIT(USBx->OUTEP_REGS[u8Tmp]->DOEPCTL, USBFS_DOEPCTL_EPENA)) {
            WRITE_REG32(USBx->OUTEP_REGS[u8Tmp]->DOEPCTL, USBFS_DOEPCTL_EPDIS | USBFS_DOEPCTL_SNAK);
        } else {
            WRITE_REG32(USBx->OUTEP_REGS[u8Tmp]->DOEPCTL, 0UL);
        }
        WRITE_REG32(USBx->OUTEP_REGS[u8Tmp]->DOEPTSIZ, 0UL);
        WRITE_REG32(USBx->OUTEP_REGS[u8Tmp]->DOEPINT, 0xFFUL);
        u8Tmp++;
    }
}

#ifdef USB_FS_MODE
static void usb_DevFSFifoConfig(LL_USB_TypeDef *USBx)
{
    uint32_t u32StardAddr;

    WRITE_REG32(USBx->GREGS->GRXFSIZ, RX_FIFO_FS_SIZE);
    /* set txFIFO and rxFIFO size of EP0 */
    u32StardAddr = RX_FIFO_FS_SIZE;
    WRITE_REG32(USBx->GREGS->HNPTXFSIZ,
                (RX_FIFO_FS_SIZE << USBFS_HNPTXFSIZ_NPTXFSA_POS) | (TX0_FIFO_FS_SIZE << USBFS_HNPTXFSIZ_NPTXFD_POS));
    /* set txFIFO size of EP1 */
    u32StardAddr += TX0_FIFO_FS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[0],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX1_FIFO_FS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP2 */
    u32StardAddr += TX1_FIFO_FS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[1],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX2_FIFO_FS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP3 */
    u32StardAddr += TX2_FIFO_FS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[2],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX3_FIFO_FS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP4 */
    u32StardAddr += TX3_FIFO_FS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[3],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX4_FIFO_FS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP5 */
    u32StardAddr += TX4_FIFO_FS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[4],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX5_FIFO_FS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
}
#endif

