RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usb.c
#ifdef USB_HS_MODE
static void usb_DevHSFifoConfig(LL_USB_TypeDef *USBx)
{
    uint32_t u32StardAddr;

    WRITE_REG32(USBx->GREGS->GRXFSIZ, RX_FIFO_HS_SIZE);
    /* set txFIFO and rxFIFO size of EP0 */
    u32StardAddr = RX_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->HNPTXFSIZ,
                (RX_FIFO_HS_SIZE << USBFS_HNPTXFSIZ_NPTXFSA_POS) | (TX0_FIFO_HS_SIZE << USBFS_HNPTXFSIZ_NPTXFD_POS));
    /* set txFIFO size of EP1 */
    u32StardAddr += TX0_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[0],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX1_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP2 */
    u32StardAddr += TX1_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[1],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX2_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP3 */
    u32StardAddr += TX2_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[2],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX3_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP4 */
    u32StardAddr += TX3_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[3],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX4_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP5 */
    u32StardAddr += TX4_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[4],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX5_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP6 */
    u32StardAddr += TX5_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[5],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX6_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP7 */
    u32StardAddr += TX6_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[6],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX7_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP8 */
    u32StardAddr += TX7_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[7],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX8_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP9 */
    u32StardAddr += TX8_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[8],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX9_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP10 */
    u32StardAddr += TX9_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[9],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX10_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP11 */
    u32StardAddr += TX10_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[10],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX11_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP12 */
    u32StardAddr += TX11_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[11],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX12_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP13 */
    u32StardAddr += TX12_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[12],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX13_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP14 */
    u32StardAddr += TX13_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[13],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX14_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
    /* set txFIFO size of EP15 */
    u32StardAddr += TX14_FIFO_HS_SIZE;
    WRITE_REG32(USBx->GREGS->DIEPTXF[14],
                (u32StardAddr << USBFS_DIEPTXF_INEPTXSA_POS) | (TX15_FIFO_HS_SIZE << USBFS_DIEPTXF_INEPTXFD_POS));
}
#endif

/**
 * @brief  initializes the USB controller, include the size of txFIFO, rxFIFO
 *         status of endpoints, interrupt register etc. Details are shown as
 *         follows.
 * @param  [in] USBx        usb instance
 * @param  [in] basic_cfgs  usb core basic cfgs
 * @retval None
 */
void usb_devmodeinit(LL_USB_TypeDef *USBx, USB_CORE_BASIC_CFGS *basic_cfgs)
{
    usb_FrameIntervalConfig(USBx, USB_FRAME_INTERVAL_80);
    usb_DevPhySelect(USBx, basic_cfgs->phy_type);

    if (basic_cfgs->core_type == 0U) {
#ifdef USB_FS_MODE
        usb_DevFSFifoConfig(USBx);
#endif
    } else {
#ifdef USB_HS_MODE
        usb_DevHSFifoConfig(USBx);
#endif
    }

    usb_clrandmskepint(USBx);
    usb_devepdis(USBx, basic_cfgs->dev_epnum);
    usb_coreconn(USBx);
    usb_devinten(USBx, basic_cfgs->dmaen);
}

/**
 * @brief  Enable the interrupt setting when in device mode.
 * @param  [in] USBx        usb instance
 * @param  [in] u8DmaEn     USB DMA status
 * @retval None
 */
void usb_devinten(LL_USB_TypeDef *USBx, uint8_t u8DmaEn)
{
    uint32_t  u32gintmskTmp = 0UL;

    WRITE_REG32(USBx->GREGS->GINTMSK, 0UL);
    WRITE_REG32(USBx->GREGS->GINTSTS, 0xBFFFFFFFUL);
    /* Enable the normal interrupt setting */
    usb_normalinten(USBx);
    if (u8DmaEn == 0U) {
        u32gintmskTmp |= USBFS_GINTMSK_RXFNEM;
    }
    /* Enable interrupts bits corresponding to the Device mode */
    u32gintmskTmp |= (USBFS_GINTMSK_USBSUSPM | USBFS_GINTMSK_USBRSTM | USBFS_GINTMSK_ENUMDNEM
                      | USBFS_GINTMSK_IEPIM | USBFS_GINTMSK_OEPIM | USBFS_GINTMSK_SOFM
                      | USBFS_GINTMSK_IISOIXFRM | USBFS_GINTMSK_IPXFRM_INCOMPISOOUTM);
#ifdef VBUS_SENSING_ENABLED
    u32gintmskTmp |= USBFS_GINTMSK_VBUSVIM;
#endif
    SET_REG32_BIT(USBx->GREGS->GINTMSK, u32gintmskTmp);
}

/**
 * @brief  get the working status of endpoint.
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @retval current status of the endpoint
 */
uint32_t usb_epstatusget(LL_USB_TypeDef *USBx, USB_DEV_EP *ep)
{
    __IO uint32_t u32Status = 0UL;
    uint32_t u32dxepctl;

    if (ep->ep_dir == 1U) {
        u32dxepctl = READ_REG32(USBx->INEP_REGS[ep->epidx]->DIEPCTL);

        if (0UL != (u32dxepctl & USBFS_DIEPCTL_STALL)) {
            u32Status = USB_EP_TX_STALL;
        } else if (0UL != (u32dxepctl & USBFS_DIEPCTL_NAKSTS)) {
            u32Status = USB_EP_TX_NAK;
        } else {
            u32Status = USB_EP_TX_VALID;
        }
    } else {
        u32dxepctl = READ_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL);
        if (0UL != (u32dxepctl & USBFS_DOEPCTL_STALL)) {
            u32Status = USB_EP_RX_STALL;
        } else if (0UL != (u32dxepctl & USBFS_DOEPCTL_NAKSTS)) {
            u32Status = USB_EP_RX_NAK;
        } else {
            u32Status = USB_EP_RX_VALID;
        }
    }

    return u32Status;
}

/**
 * @brief  set the working status of endpoint.
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @param  [in] Status      new Status that the endpoint would be
 * @retval None
 */
void usb_epstatusset(LL_USB_TypeDef *USBx, USB_DEV_EP *ep, uint32_t Status)
{
    uint32_t u32dxepctl;
    uint8_t u8RetFlag = 0U;

    if (ep->ep_dir == 1U) {
        u32dxepctl = READ_REG32(USBx->INEP_REGS[ep->epidx]->DIEPCTL);

        switch (Status) {
            case USB_EP_TX_STALL:
                usb_setepstall(USBx, ep);
                u8RetFlag = 1U;
                break;
            case USB_EP_TX_NAK:
                u32dxepctl |= USBFS_DIEPCTL_SNAK;
                break;
            case USB_EP_TX_VALID:
                if (0UL != (u32dxepctl & USBFS_DIEPCTL_STALL)) {
                    ep->datax_pid = 0U;
                    usb_clearepstall(USBx, ep);
                    u8RetFlag = 1U;
                }
                u32dxepctl |= (USBFS_DIEPCTL_CNAK | USBFS_DIEPCTL_USBAEP | USBFS_DIEPCTL_EPENA);
                break;
            case USB_EP_TX_DIS:
                u32dxepctl &= (~USBFS_DIEPCTL_USBAEP);
                break;
            default:
                break;
        }
        /* Write register */
        if (1U != u8RetFlag) {
            WRITE_REG32(USBx->INEP_REGS[ep->epidx]->DIEPCTL, u32dxepctl);
        }
    } else {
        u32dxepctl = READ_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL);

        switch (Status) {
            case USB_EP_RX_STALL:
                u32dxepctl |= USBFS_DOEPCTL_STALL;
                break;
            case USB_EP_RX_NAK:
                u32dxepctl |= USBFS_DOEPCTL_SNAK;
                break;
            case USB_EP_RX_VALID:
                if (0UL != (u32dxepctl & USBFS_DOEPCTL_STALL)) {
                    ep->datax_pid = 0U;
                    usb_clearepstall(USBx, ep);
                    u8RetFlag = 1U;
                }
                u32dxepctl |= (USBFS_DOEPCTL_CNAK | USBFS_DOEPCTL_USBAEP | USBFS_DOEPCTL_EPENA);
                break;
            case USB_EP_RX_DIS:
                u32dxepctl &= (~USBFS_DOEPCTL_USBAEP);
                break;
            default:
                break;
        }
        /* Write register */
        if (1U != u8RetFlag) {
            WRITE_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL, u32dxepctl);
        }
    }
}

/**
 * @brief  enable the EP0 to be actiove
 * @param  [in] USBx        usb instance
 * @retval None
 */
void  usb_ep0activate(LL_USB_TypeDef *USBx)
{
    uint32_t u32EnumSpeed;
    uint32_t u32DiepctlTmp;

    u32EnumSpeed = READ_REG32(USBx->DREGS->DSTS) & USBFS_DSTS_ENUMSPD;
    u32DiepctlTmp = READ_REG32(USBx->INEP_REGS[0]->DIEPCTL);
    /* Set the MPS of the DIEPCTL0 based on the enumeration speed */
    if ((DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ == u32EnumSpeed)
            || (DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ == u32EnumSpeed)
            || (DSTS_ENUMSPD_FS_PHY_48MHZ == u32EnumSpeed)) {
        u32DiepctlTmp &= (~USBFS_DIEPCTL_MPSIZ);
    } else if (DSTS_ENUMSPD_LS_PHY_6MHZ == u32EnumSpeed) {
        u32DiepctlTmp &= (~USBFS_DIEPCTL_MPSIZ);
        u32DiepctlTmp |= (3UL << USBFS_DIEPCTL_MPSIZ_POS);
    } else {
        ;
    }
    WRITE_REG32(USBx->INEP_REGS[0]->DIEPCTL, u32DiepctlTmp);
    SET_REG32_BIT(USBx->DREGS->DCTL, USBFS_DCTL_CGINAK);
}

/**
 * @brief  enable an EP to be active
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @retval None
 */
void usb_epactive(LL_USB_TypeDef *USBx, USB_DEV_EP *ep)
{
    uint32_t u32Addr;
    uint32_t u32dxepctl;
    uint32_t u32Daintmsk;

    if (ep->ep_dir == 1U) {
        u32Addr = (uint32_t)(&(USBx->INEP_REGS[ep->epidx]->DIEPCTL));
        u32Daintmsk = 1UL << ep->epidx;
    } else {
        u32Addr = (uint32_t)(&(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL));
        u32Daintmsk = 1UL << (USBFS_DAINTMSK_OEPINTM_POS + ep->epidx);
    }
    u32dxepctl = READ_REG32(*(__IO uint32_t *)u32Addr);
    if (0UL == (u32dxepctl & USBFS_DIEPCTL_USBAEP)) {
        u32dxepctl = ((ep->maxpacket << USBFS_DIEPCTL_MPSIZ_POS)
                      | (((uint32_t)ep->trans_type) << USBFS_DIEPCTL_EPTYP_POS)
                      | (((uint32_t)ep->tx_fifo_num) << USBFS_DIEPCTL_TXFNUM_POS)
                      | USBFS_DIEPCTL_SD0PID_SEVNFRM
                      | USBFS_DIEPCTL_USBAEP);

        WRITE_REG32(*(__IO uint32_t *)u32Addr, u32dxepctl);
    }
    SET_REG32_BIT(USBx->DREGS->DAINTMSK, u32Daintmsk);
}

/**
 * @brief  enable an EP to be deactive state if it is active
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @retval None
 */
void usb_epdeactive(LL_USB_TypeDef *USBx, USB_DEV_EP *ep)
{
    uint32_t u32Daintmsk;

    if (ep->ep_dir == 1U) {
        CLR_REG32_BIT(USBx->INEP_REGS[ep->epidx]->DIEPCTL, USBFS_DIEPCTL_USBAEP);
        u32Daintmsk  = 1UL << ep->epidx;
    } else {
        CLR_REG32_BIT(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL, USBFS_DOEPCTL_USBAEP);
        u32Daintmsk = 1UL << (USBFS_DAINTMSK_OEPINTM_POS + ep->epidx);
    }
    CLR_REG32_BIT(USBx->DREGS->DAINTMSK, u32Daintmsk);
}

/**
 * @brief  Setup the data into the EP and begin to transmit data.
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @param  [in] u8DmaEn     USB DMA status
 * @retval None
 */
void usb_epntransbegin(LL_USB_TypeDef *USBx, USB_DEV_EP *ep, uint8_t u8DmaEn)
{
    uint32_t u32depctl;
    uint32_t u32DeptsizTmp;
    uint32_t u32Pktcnt;
    uint32_t u32Xfersize;

    if (ep->ep_dir == 1U) {
        u32depctl = READ_REG32(USBx->INEP_REGS[ep->epidx]->DIEPCTL);
        /* Zero Length Packet? */
        if (ep->xfer_len == 0UL) {
            u32Xfersize = 0UL;
            u32Pktcnt = 1UL;
            u32DeptsizTmp = (u32Xfersize << USBFS_DIEPTSIZ_XFRSIZ_POS) | (u32Pktcnt << USBFS_DIEPTSIZ_PKTCNT_POS);
        } else {
            /* Program the transfer size and packet count
            * as follows: xfersize = N * maxpacket +
            * short_packet pktcnt = N + (short_packet
            * exist ? 1 : 0)
            */
            u32Xfersize = ep->xfer_len;
            u32Pktcnt = (ep->xfer_len - 1U + ep->maxpacket) / ep->maxpacket;
            u32DeptsizTmp = (u32Xfersize << USBFS_DIEPTSIZ_XFRSIZ_POS) | (u32Pktcnt << USBFS_DIEPTSIZ_PKTCNT_POS);
        }
        MODIFY_REG32(USBx->INEP_REGS[ep->epidx]->DIEPTSIZ, USBFS_DIEPTSIZ_XFRSIZ | USBFS_DIEPTSIZ_PKTCNT, u32DeptsizTmp);

        if (u8DmaEn == 1U) {
            WRITE_REG32(USBx->INEP_REGS[ep->epidx]->DIEPDMA, ep->dma_addr);
        } else {
            if (ep->trans_type != EP_TYPE_ISOC) {
                /* Enable the Tx FIFO Empty Interrupt for this EP */
                if (ep->xfer_len > 0U) {
                    SET_REG32_BIT(USBx->DREGS->DIEPEMPMSK, 1UL << ep->epidx);
                }
            }
        }

        if (ep->trans_type == EP_TYPE_ISOC) {
            if (((READ_REG32(USBx->DREGS->DSTS) >> USBFS_DSTS_FNSOF_POS) & 0x1U) == 0U) {
                u32depctl |= USBFS_DIEPCTL_SODDFRM;
            } else {
                u32depctl |= USBFS_DIEPCTL_SD0PID_SEVNFRM;
            }
        }

        u32depctl |= (USBFS_DIEPCTL_CNAK | USBFS_DIEPCTL_EPENA);
        WRITE_REG32(USBx->INEP_REGS[ep->epidx]->DIEPCTL, u32depctl);

        if (ep->trans_type == EP_TYPE_ISOC) {
            usb_wrpkt(USBx, ep->xfer_buff, ep->epidx, (uint16_t)ep->xfer_len, u8DmaEn);
        }
    } else {
        u32depctl = READ_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL);
        /* Program the transfer size and packet count as follows:
        * pktcnt = N
        * xfersize = N * maxpacket
        */
        if (ep->xfer_len == 0U) {
            u32Xfersize = ep->maxpacket;
            u32Pktcnt = 1UL;
            u32DeptsizTmp = (u32Xfersize << USBFS_DOEPTSIZ_XFRSIZ_POS) | (u32Pktcnt << USBFS_DOEPTSIZ_PKTCNT_POS);
        } else {
            u32Pktcnt   = (ep->xfer_len + (ep->maxpacket - 1U)) / ep->maxpacket;
            u32Xfersize = u32Pktcnt * ep->maxpacket;
            u32DeptsizTmp = (u32Xfersize << USBFS_DOEPTSIZ_XFRSIZ_POS) | (u32Pktcnt << USBFS_DOEPTSIZ_PKTCNT_POS);
            ep->xfer_len = u32Xfersize;
        }
        MODIFY_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPTSIZ, USBFS_DOEPTSIZ_XFRSIZ | USBFS_DOEPTSIZ_PKTCNT, u32DeptsizTmp);

        if (u8DmaEn == 1U) {
            WRITE_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPDMA, ep->dma_addr);
        }

        if (ep->trans_type == EP_TYPE_ISOC) {
            if (0U != ep->datax_pid) {
                u32depctl |= USBFS_DOEPCTL_SD1PID;
            } else {
                u32depctl |= USBFS_DOEPCTL_SD0PID;
            }
        }
        u32depctl |= (USBFS_DOEPCTL_CNAK | USBFS_DOEPCTL_EPENA);
        WRITE_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL, u32depctl);
    }
}

/**
 * @brief  Setup the data into the EP0 and begin to transmit data.
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @param  [in] u8DmaEn     USB DMA status
 * @retval None
 */
void usb_ep0transbegin(LL_USB_TypeDef *USBx, USB_DEV_EP *ep, uint8_t u8DmaEn)
{
    uint32_t u32depctl;
    uint32_t u32DeptsizTmp;
    uint32_t u32Pktcnt;
    uint32_t u32Xfersize;

    if (ep->ep_dir == 1U) {
        u32depctl = READ_REG32(USBx->INEP_REGS[0]->DIEPCTL);
        /* Zero Length Packet? */
        if (ep->xfer_len == 0U) {
            u32Xfersize = 0UL;
            u32Pktcnt = 1UL;
            u32DeptsizTmp = (u32Xfersize << USBFS_DIEPTSIZ_XFRSIZ_POS) | (u32Pktcnt << USBFS_DIEPTSIZ_PKTCNT_POS);
        } else {
            if (ep->xfer_len > ep->maxpacket) {
                ep->xfer_len = ep->maxpacket;
                u32Xfersize = ep->maxpacket;
            } else {
                u32Xfersize = ep->xfer_len;
            }
            u32Pktcnt = 1UL;
            u32DeptsizTmp = (u32Xfersize << USBFS_DIEPTSIZ_XFRSIZ_POS) | (u32Pktcnt << USBFS_DIEPTSIZ_PKTCNT_POS);
        }
        MODIFY_REG32(USBx->INEP_REGS[0]->DIEPTSIZ, USBFS_DIEPTSIZ_XFRSIZ | USBFS_DIEPTSIZ_PKTCNT, u32DeptsizTmp);

        if (u8DmaEn == 1U) {
            WRITE_REG32(USBx->INEP_REGS[ep->epidx]->DIEPDMA, ep->dma_addr);
        }

        u32depctl |= (USBFS_DIEPCTL_CNAK | USBFS_DIEPCTL_EPENA);
        WRITE_REG32(USBx->INEP_REGS[0]->DIEPCTL, u32depctl);

        if (u8DmaEn == 0U) {
            /* Enable the Tx FIFO Empty Interrupt for this EP */
            if (ep->xfer_len > 0U) {
                SET_REG32_BIT(USBx->DREGS->DIEPEMPMSK, 1UL << ep->epidx);
            }
        }
    } else {
        u32depctl  = READ_REG32(USBx->OUTEP_REGS[0]->DOEPCTL);
        /* Program the transfer size and packet count as follows:
        * xfersize = N * (maxpacket + 4 - (maxpacket % 4))
        * pktcnt = N           */
        if (ep->xfer_len == 0U) {
            u32Xfersize = 0UL;
            u32Pktcnt = 1UL;
        } else {
            ep->xfer_len = LL_MIN(ep->rem_data_len, ep->maxpacket);
            u32Xfersize = ep->xfer_len;
            u32Pktcnt   = 1UL;
        }
        u32DeptsizTmp = (u32Xfersize << USBFS_DOEPTSIZ_XFRSIZ_POS) | (u32Pktcnt << USBFS_DOEPTSIZ_PKTCNT_POS);
        MODIFY_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPTSIZ, USBFS_DOEPTSIZ_XFRSIZ | USBFS_DOEPTSIZ_PKTCNT, u32DeptsizTmp);

        if (u8DmaEn == 1U) {
            WRITE_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPDMA, ep->dma_addr);
        }
        u32depctl |= (USBFS_DOEPCTL_CNAK | USBFS_DOEPCTL_EPENA);
        WRITE_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL, u32depctl);
    }
}

/**
 * @brief  Set the EP to be stall status
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @retval None
 */
void usb_setepstall(LL_USB_TypeDef *USBx, USB_DEV_EP *ep)
{
    uint32_t u32depctl;

    if (ep->ep_dir == 1U) {
        u32depctl = READ_REG32(USBx->INEP_REGS[ep->epidx]->DIEPCTL);
        if (0UL != (u32depctl & USBFS_DIEPCTL_EPENA)) {
            u32depctl |= USBFS_DIEPCTL_EPDIS;
        }
        u32depctl |= USBFS_DIEPCTL_STALL;
        WRITE_REG32(USBx->INEP_REGS[ep->epidx]->DIEPCTL, u32depctl);
    } else {
        u32depctl = READ_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL);
        u32depctl |= USBFS_DOEPCTL_STALL;
        WRITE_REG32(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL, u32depctl);
    }
}

/**
 * @brief  clear the stall status of a EP
 * @param  [in] USBx        usb instance
 * @param  [in] ep          endpoint instance
 * @retval None
 */
void usb_clearepstall(LL_USB_TypeDef *USBx, USB_DEV_EP *ep)
{
    uint32_t tmp_depctl_addr;
    uint32_t u32depctl;

    if (ep->ep_dir == 1U) {
        tmp_depctl_addr = (uint32_t)(&(USBx->INEP_REGS[ep->epidx]->DIEPCTL));
    } else {
        tmp_depctl_addr = (uint32_t)(&(USBx->OUTEP_REGS[ep->epidx]->DOEPCTL));
    }
    u32depctl = READ_REG32(tmp_depctl_addr);

    u32depctl &= (~USBFS_DIEPCTL_STALL);
    if ((ep->trans_type == EP_TYPE_INTR) || (ep->trans_type == EP_TYPE_BULK)) {
        u32depctl |= USBFS_DIEPCTL_SD0PID_SEVNFRM;
    }

    WRITE_REG32(*(__IO uint32_t *)tmp_depctl_addr, u32depctl);
}

/**
 * @brief  configure the EPO to receive data packets
 * @param  [in] USBx        usb instance
 * @param  [in] u8DmaEn     USB DMA status
 * @retval None
 */
void usb_ep0revcfg(LL_USB_TypeDef *USBx, uint8_t u8DmaEn, uint8_t *u8RevBuf)
{
    uint32_t u32deptsize;
    uint32_t u32doepctl;

