RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usb.c
    u32deptsize = (3UL << USBFS_DOEPTSIZ0_STUPCNT_POS)
                  | (1UL << USBFS_DOEPTSIZ0_PKTCNT_POS)
                  | (64UL << USBFS_DOEPTSIZ0_XFRSIZ_POS);

    WRITE_REG32(USBx->OUTEP_REGS[0]->DOEPTSIZ, u32deptsize);

    if (u8DmaEn == 1U) {
        WRITE_REG32(USBx->OUTEP_REGS[0]->DOEPDMA, (uint32_t)&u8RevBuf);
        u32doepctl = READ_REG32(USBx->OUTEP_REGS[0]->DOEPCTL);
        u32doepctl |= (USBFS_DOEPCTL_EPENA | USBFS_DOEPCTL_USBAEP);
        WRITE_REG32(USBx->OUTEP_REGS[0]->DOEPCTL, u32doepctl);
    }
}

/**
 * @brief  enable remote wakeup active
 * @param  [in] USBx        usb instance
 * @retval None
 */
void usb_remotewakeupen(LL_USB_TypeDef *USBx)
{
    uint32_t u32dsts;

    u32dsts = READ_REG32(USBx->DREGS->DSTS);
    if (0UL != (u32dsts & USBFS_DSTS_SUSPSTS)) {
        /* un-gate USB Core clock */
        CLR_REG32_BIT(*USBx->GCCTL, USBFS_GCCTL_GATEHCLK | USBFS_GCCTL_STPPCLK);
    }

    SET_REG32_BIT(USBx->DREGS->DCTL, USBFS_DCTL_RWUSIG);
    usb_mdelay(5UL);
    CLR_REG32_BIT(USBx->DREGS->DCTL, USBFS_DCTL_RWUSIG);
}

/**
 * @brief  control the device to connect or disconnect
 * @param  [in] USBx        usb instance
 * @param  [in] link        0(conn) or 1(disconn)
 * @retval None
 */
void usb_ctrldevconnect(LL_USB_TypeDef *USBx, uint8_t link)
{
    if (0U == link) {
        CLR_REG32_BIT(USBx->DREGS->DCTL, USBFS_DCTL_SDIS);
    } else {
        SET_REG32_BIT(USBx->DREGS->DCTL, USBFS_DCTL_SDIS);
    }
    usb_mdelay(3UL);
}
#endif

#ifdef USE_HOST_MODE
/**
 * @brief  Initializes the USB controller when it is host mode
 * @param  [in] USBx        usb instance
 * @param  [in] basic_cfgs  usb core basic cfgs
 * @retval None
 */
void usb_hostmodeinit(LL_USB_TypeDef *USBx, USB_CORE_BASIC_CFGS *basic_cfgs)
{
    __IO uint8_t u8Tmp = 0U;
    WRITE_REG32(*USBx->GCCTL, 0UL);  /* reset the register-GCCTL */
#ifdef USB_HS_EXTERNAL_PHY
    usb_fslspclkselset(USBx, HCFG_30_60_MHZ);  /* PHY clock is running at 6MHz */
#else
    usb_fslspclkselset(USBx, HCFG_6_MHZ);  /* PHY clock is running at 6MHz */
#endif
    usb_hprtrst(USBx);                     /* reset the port */
    usb_enumspeed(USBx);                   /* FS or LS bases on the maximum speed supported by the connected device */
    usb_sethostfifo(USBx);
    /* Flush all the txFIFO and the whole rxFIFO */
    usb_txfifoflush(USBx, 0x10UL);
    usb_rxfifoflush(USBx);
    /* Clear all HC Interrupt bits that are pending */
    while (u8Tmp < basic_cfgs->host_chnum) {
        WRITE_REG32(USBx->HC_REGS[u8Tmp]->HCINT, 0xFFFFFFFFUL);
        WRITE_REG32(USBx->HC_REGS[u8Tmp]->HCINTMSK, 0UL);
        u8Tmp++;
    }
    usb_hostinten(USBx, basic_cfgs->dmaen);
}

/**
 * @brief  set the vbus if state is 1 or reset the vbus if state is 0.
 * @param  [in] USBx        usb instance
 * @param  [in] u8State       the vbus state it would be.
 * @retval None
 */
void usb_vbusctrl(LL_USB_TypeDef *USBx, uint8_t u8State)
{
    uint32_t u32hprt;

    /* enable or disable the external charge pump */
    usb_bsp_drivevbus(USBx, u8State);
    u32hprt = usb_rdhprt(USBx);
    if ((0UL == (u32hprt & USBFS_HPRT_PWPR)) && (1U == u8State)) {
        u32hprt |= USBFS_HPRT_PWPR;
        WRITE_REG32(*USBx->HPRT, u32hprt);
    }
    if ((0UL != (u32hprt & USBFS_HPRT_PWPR)) && (0U == u8State)) {
        u32hprt &= (~USBFS_HPRT_PWPR);
        WRITE_REG32(*USBx->HPRT, u32hprt);
    }
}

/**
 * @brief  Enables the related interrupts when the core is host mode
 * @param  [in] USBx        usb instance
 * @param  [in] u8DmaEn     USB DMA status
 * @retval None
 */
void usb_hostinten(LL_USB_TypeDef *USBx, uint8_t u8DmaEn)
{
    uint32_t u32gIntmsk = 0UL;
    WRITE_REG32(USBx->GREGS->GINTMSK, 0UL);
    /* Clear the pending interrupt bits */
    WRITE_REG32(USBx->GREGS->GINTSTS, 0xFFFFFFFFUL);

    /* Enable the normal interrupt bits */
    usb_normalinten(USBx);

    if (u8DmaEn == 0U) {
        u32gIntmsk |= USBFS_GINTMSK_RXFNEM;
    }
    u32gIntmsk |= (USBFS_GINTMSK_HPRTIM
                   | USBFS_GINTMSK_HCIM
                   | USBFS_GINTMSK_DISCIM
                   | USBFS_GINTMSK_SOFM
                   | USBFS_GINTMSK_IPXFRM_INCOMPISOOUTM);
    SET_REG32_BIT(USBx->GREGS->GINTMSK, u32gIntmsk);
}

/**
 * @brief  Reset the port, the 1'b0 state must last at lease 10ms.
 * @param  [in] USBx        usb instance
 * @retval None
 */
void usb_hprtrst(LL_USB_TypeDef *USBx)
{
    uint32_t u32hprt;
    u32hprt = usb_rdhprt(USBx);
    u32hprt |= USBFS_HPRT_PRST;
    WRITE_REG32(*USBx->HPRT, u32hprt);
    usb_mdelay(10UL);
    u32hprt &= ~USBFS_HPRT_PRST;
    WRITE_REG32(*USBx->HPRT, u32hprt);
    usb_mdelay(20UL);

    //SET_REG32_BIT(*USBx->HPRT, USBFS_HPRT_PRST);
    //usb_mdelay(10UL);
    //CLR_REG32_BIT(*USBx->HPRT, USBFS_HPRT_PRST);
    //usb_mdelay(20UL);
}

/**
 * @brief  Prepares transferring packets on a host channel
 * @param  [in] USBx        usb instance
 * @param  [in] hc_num      channel index
 * @param  [in] pCh         channel structure
 * @param  [in] u8DmaEn     USB DMA status
 * @retval status in byte
 */
uint8_t usb_inithch(LL_USB_TypeDef *USBx, uint8_t hc_num, USB_HOST_CH *pCh, uint8_t u8DmaEn)
{
    uint32_t u32hcintmsk = 0UL;
    uint32_t u32hcchar = 0UL;

    WRITE_REG32(USBx->HC_REGS[hc_num]->HCINT, 0xFFFFFFFFUL);
    switch (pCh->ep_type) {
        case EP_TYPE_CTRL:
        case EP_TYPE_BULK:
            u32hcintmsk |= (USBFS_HCINTMSK_XFRCM
                            | USBFS_HCINTMSK_STALLM
                            | USBFS_HCINTMSK_TXERRM
                            | USBFS_HCINTMSK_DTERRM
                            | USBFS_HCINTMSK_NAKM);
            if (0U != pCh->is_epin) {
                u32hcintmsk |= USBFS_HCINTMSK_BBERRM;
            } else {
                if (0U != pCh->do_ping) {
                    u32hcintmsk |= USBFS_HCINTMSK_ACKM;
                }
            }
            break;
        case EP_TYPE_INTR:
            u32hcintmsk |= (USBFS_HCINTMSK_XFRCM
                            | USBFS_HCINTMSK_NAKM
                            | USBFS_HCINTMSK_STALLM
                            | USBFS_HCINTMSK_TXERRM
                            | USBFS_HCINTMSK_DTERRM
                            | USBFS_HCINTMSK_FRMORM);
            if (0U != pCh->is_epin) {
                u32hcintmsk |= USBFS_HCINTMSK_BBERRM;
            }
            break;
        case EP_TYPE_ISOC:
            u32hcintmsk |= (USBFS_HCINTMSK_XFRCM
                            | USBFS_HCINTMSK_FRMORM
                            | USBFS_HCINTMSK_ACKM);

            if (0U != pCh->is_epin) {
                u32hcintmsk |= (USBFS_HCINTMSK_TXERRM | USBFS_HCINTMSK_BBERRM);
            }
            break;
        default:
            break;
    }

    WRITE_REG32(USBx->HC_REGS[hc_num]->HCINTMSK, u32hcintmsk);
    SET_REG32_BIT(USBx->HREGS->HAINTMSK, 1UL << hc_num);

