RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usb.c
    /* enable the host channel interrupts */
    SET_REG32_BIT(USBx->GREGS->GINTMSK, USBFS_GINTMSK_HCIM);

    /* modify HCCHAR */
    u32hcchar |= (((uint32_t)pCh->dev_addr) << USBFS_HCCHAR_DAD_POS);
    u32hcchar |= (((uint32_t)pCh->ep_idx) << USBFS_HCCHAR_EPNUM_POS);
    u32hcchar |= (((uint32_t)pCh->is_epin) << USBFS_HCCHAR_EPDIR_POS);
    u32hcchar |= (((uint32_t)pCh->ep_type) << USBFS_HCCHAR_EPTYP_POS);
    u32hcchar |= (((uint32_t)pCh->max_packet) << USBFS_HCCHAR_MPSIZ_POS);
    if (PRTSPD_LOW_SPEED == pCh->ch_speed) {
        u32hcchar |= USBFS_HCCHAR_LSDEV;
    } else {
        u32hcchar &= ~USBFS_HCCHAR_LSDEV;
    }

    if (pCh->ep_type == EP_TYPE_INTR) {
        u32hcchar |= USBFS_HCCHAR_ODDFRM;
    }
    WRITE_REG32(USBx->HC_REGS[hc_num]->HCCHAR, u32hcchar);
    return USB_OK;
}

/**
 * @brief  Start transfer on the channel whose index is hc_num.
 * @param  [in] USBx        usb instance
 * @param  [in] hc_num      channel index
 * @param  [in] pCh         channel structure
 * @param  [in] u8DmaEn     USB DMA status
 * @retval status in 8 bits
 */
uint8_t usb_hchtransbegin(LL_USB_TypeDef *USBx, uint8_t hc_num, USB_HOST_CH *pCh, uint8_t u8DmaEn)
{
    uint32_t u32hcchar;
    uint32_t u32hctsiz = 0UL;
    uint32_t u32hnptxsts;
    uint32_t u32hptxsts;
    uint16_t u16LenWords;
    uint16_t u16NumPacket;
    uint16_t u16MaxHcPktCount = 256U;

    /* Compute the expected number of packets associated to the transfer */
    if (pCh->xfer_len > 0U) {
        u16NumPacket = (uint16_t)((pCh->xfer_len +
                                   (uint32_t)pCh->max_packet - 1UL) / (uint32_t)pCh->max_packet);

        if (u16NumPacket > u16MaxHcPktCount) {
            u16NumPacket = u16MaxHcPktCount;
            pCh->xfer_len = (uint32_t)u16NumPacket * (uint32_t)pCh->max_packet;
        }
    } else {
        u16NumPacket = 1U;
    }
    if (0U != pCh->is_epin) {
        pCh->xfer_len = (uint32_t)u16NumPacket * (uint32_t)pCh->max_packet;
    }

    u32hctsiz |= (((uint32_t)pCh->xfer_len) << USBFS_HCTSIZ_XFRSIZ_POS);
    u32hctsiz |= (((uint32_t)u16NumPacket) << USBFS_HCTSIZ_PKTCNT_POS);
    u32hctsiz |= (((uint32_t)pCh->pid_type) << USBFS_HCTSIZ_DPID_POS);
    WRITE_REG32(USBx->HC_REGS[hc_num]->HCTSIZ, u32hctsiz);

    if (u8DmaEn == 1U) {
        WRITE_REG32(USBx->HC_REGS[hc_num]->HCDMA, pCh->xfer_buff);
    }

    u32hcchar = READ_REG32(USBx->HC_REGS[hc_num]->HCCHAR);
    u32hcchar |= (usb_ifevenframe(USBx) << USBFS_HCCHAR_ODDFRM_POS);

    /* enable this host channel whose number is hc_num */
    u32hcchar |= USBFS_HCCHAR_CHENA;
    u32hcchar &= ~USBFS_HCCHAR_CHDIS;
    WRITE_REG32(USBx->HC_REGS[hc_num]->HCCHAR, u32hcchar);

    if (u8DmaEn == 0U) {
        if ((pCh->is_epin == 0U) && (pCh->xfer_len > 0U)) {
            switch (pCh->ep_type) {
                /* Non-periodic transmit */
                case EP_TYPE_CTRL:
                case EP_TYPE_BULK:
                    u32hnptxsts = READ_REG32(USBx->GREGS->HNPTXSTS);
                    u16LenWords = (uint16_t)((pCh->xfer_len + 3UL) / 4UL);
                    /* check if the amount of free space available in the non-periodic txFIFO is enough */
                    if (u16LenWords > ((u32hnptxsts & USBFS_HNPTXSTS_NPTXFSAV) >> USBFS_HNPTXSTS_NPTXFSAV_POS)) {
                        /* enable interrrupt of nptxfempty of GINTMSK*/
                        SET_REG32_BIT(USBx->GREGS->GINTMSK, USBFS_GINTMSK_NPTXFEM);
                    }
                    break;
                /* Periodic trnsmit */
                case EP_TYPE_INTR:
                case EP_TYPE_ISOC:
                    u32hptxsts = READ_REG32(USBx->HREGS->HPTXSTS);
                    u16LenWords = (uint16_t)((pCh->xfer_len + 3UL) / 4UL);
                    /* check if the space of periodic TxFIFO is enough */
                    if (u16LenWords > ((u32hptxsts & USBFS_HPTXSTS_PTXFSAVL) >> USBFS_HPTXSTS_PTXFSAVL_POS)) {
                        /* enable interrrupt of ptxfempty of GINTMSK */
                        SET_REG32_BIT(USBx->GREGS->GINTMSK, USBFS_GINTMSK_PTXFEM);
                    }
                    break;
                default:
                    break;
            }

            usb_wrpkt(USBx, pCh->xfer_buff, hc_num, (uint16_t)pCh->xfer_len, u8DmaEn);
        }
    }
    return USB_OK;
}

/**
 * @brief  Stop the host and flush all the txFIFOs and the whole rxFIFO.
 * @param  [in] USBx        usb instance
 * @param  [in] u8ChNum     Host channel number
 * @retval None
 */
void usb_hoststop(LL_USB_TypeDef *USBx, uint8_t u8ChNum)
{
    __IO uint32_t u32Tmp = 0UL;

    WRITE_REG32(USBx->HREGS->HAINTMSK, 0UL);
    WRITE_REG32(USBx->HREGS->HAINT, 0xFFFFFFFFUL);

    do {
        usb_chrst(USBx, (uint8_t)u32Tmp);
        u32Tmp++;
    } while (u32Tmp < u8ChNum);
    /* flush all the txFIFOs and the whole rxFIFO */
    usb_rxfifoflush(USBx);
    usb_txfifoflush(USBx, 0x10UL);
}

/**
 * @brief  make the channel to halt
 * @param  [in] USBx        usb instance
 * @param  [in] hc_num      channel index
 * @retval None
 */
void usb_hchstop(LL_USB_TypeDef *USBx, uint8_t hc_num)
{
    uint32_t u32hcchar;

    u32hcchar = READ_REG32(USBx->HC_REGS[hc_num]->HCCHAR);
    u32hcchar |= (USBFS_HCCHAR_CHENA | USBFS_HCCHAR_CHDIS);
    /* Check for space in the request queue to issue the halt. */
    if ((EP_TYPE_CTRL == ((u32hcchar & USBFS_HCCHAR_EPTYP) >> USBFS_HCCHAR_EPTYP_POS))
            || (EP_TYPE_BULK == ((u32hcchar & USBFS_HCCHAR_EPTYP) >> USBFS_HCCHAR_EPTYP_POS))) {
        if (0UL == (READ_REG32(USBx->GREGS->HNPTXSTS) & USBFS_HNPTXSTS_NPTQXSAV)) {
            u32hcchar &= (~USBFS_HCCHAR_CHENA);
        }
    } else {
        if (0UL == (READ_REG32(USBx->HREGS->HPTXSTS) & USBFS_HPTXSTS_PTXQSAV)) {
            u32hcchar &= (~USBFS_HCCHAR_CHENA);
        }
    }
    WRITE_REG32(USBx->HC_REGS[hc_num]->HCCHAR, u32hcchar);
}

#endif

/**
 * @}
*/

#endif /* LL_USB_ENABLE */

/**
 * @}
*/

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
